import bcrypt from 'bcryptjs';
import mongoose from 'mongoose';
const { ObjectId } = mongoose.Types;

const data = {
  users: [
    {
      name: 'Nastya',
      email: 'admin@example.com',
      password: bcrypt.hashSync('123456'),
      isAdmin: true,
    },
    {
      name: 'Asya',
      email: 'user@example.com',
      password: bcrypt.hashSync('123456'),
      isAdmin: false,
    },
  ],
  products: [
    {
      name: 'Java',
      slug: 'java',
      image: 'java.png',
      images: ['java1.png', 'java2.png'],
      category: 'Програмування',
      developers: 'Команда під керівництвом Джеймса Гослінга',
      description:
        'Java - це обєктно-орієнтована мова програмування, яка була створена в 1991 році Джеймсом Гослінгом та його командою в Sun Microsystems (згодом придбана компанією Oracle). Java була спочатку розроблена для використання в стаціонарних компютерах, але згодом стала популярною для веб-розробки та інших додатків.Java є високорівневою мовою програмування, що означає, що вона має більш абстрактний синтаксис, що дозволяє програмістам писати код на більш природній для людини мові. Вона має обєктно-орієнтований підхід, що дозволяє розбити програму на окремі обєкти, які взаємодіють між собою.Java є переносимою мовою програмування, що означає, що програма, написана на одній платформі, може запускатися на будь-якій іншій платформі без необхідності перекомпілювати код. Це досягається за допомогою віртуальної машини Java (JVM), яка інтерпретує байт-код, що генерується після компіляції програми.Java має багатий набір бібліотек, що дозволяє програмістам ефективно взаємодіяти з різними системами та технологіями, такими як бази даних, мережі та графічний інтерфейс користувача. Крім того, Java має вбудовану систему обробки помилок, що дозволяє легко виявляти та виправляти помилки в коді.',
      releaseDate: '23 грудня 1995 року',
      pros: [
        'Переносимість: Java можна виконувати на будь-якій платформі, що підтримує віртуальну машину Java (JVM).',
        'Надійність: Java є дуже надійною мовою програмування, оскільки вона має вбудовану систему управління памяттю та автоматичного збору сміття, що запобігає багатьом типам помилок.',
        'Безпека: Java має ряд вбудованих механізмів безпеки, які забезпечують захист від вірусів та інших видів зловмисного програмного забезпечення.',
      ],
      cons: [
        'Повільність: JVM, хоч і робить Java переносимою та надійною, може впливати на продуктивність програм.',
        'Складність: Java може бути складною для вивчення, коли потрібно виконати більш складні завдання.',
        'исока вимога до ресурсів: Java використовує велику кількість памяті та обчислювальних ресурсів, що може впливати на продуктивність систем.',
      ],
      purpose:
        'Java - це мова програмування, яка використовується для розробки різноманітних програм, від мобільних додатків до великих корпоративних застосунків. Вона підтримує крос-платформову розробку, що дозволяє створювати програми, які працюватимуть на будь-якій операційній системі, яка підтримує віртуальну машину Java.',
      versions:
        'Java SE 1.0, 1.1, 1.2, 1.3, 1.4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 та 17. ',
      rating: 4.5,
      numReviews: 10,
      syntax: mongoose.Types.ObjectId('6444151aaa21aa29590fa4c0'),
    },
    {
      name: 'Python',
      slug: 'python',
      image: '/images/python.jpg',
      images: ['python1.png', 'python2.png'],
      category: 'Програмування',
      developers: 'Нідерландський програміст Гвідо ван Россум',
      description:
        'Python - це високорівнева, інтерпретована мова програмування, створена в 1991 році Гвідо ван Россумом. Python має чистий, лаконічний синтаксис та просту в освоєнні структуру даних, що робить його дуже популярним серед початківців. Python має широке застосування в галузі науки, техніки, веб-розробки та машинного навчання.Особливістю мови Python є автоматичне управління памяттю, яке зменшує ризик виникнення помилок в програмах. Python має вбудовану підтримку роботи з рядками, списками, словниками, кортежами, множинами та іншими структурами даних, що дозволяє розробляти динамічні програми з легкістю. Python підтримує функціональне та обєктно-орієнтоване програмування, а також може використовуватись як скриптова мова.',
      releaseDate: 'березень 1994 року',
      pros: [
        'Легкий вивчення та читання: Python має простий та зрозумілий синтаксис, що дозволяє легко вивчати та читати код на цій мові.',
        'Велика кількість бібліотек: Python має велику кількість стандартних бібліотек та додаткових модулів, що значно полегшує розробку програм на цій мові.',
        'Крос-платформений: Python може працювати на різних операційних системах, таких як Windows, MacOS, Linux тощо.',
      ],
      cons: [
        'Повільність: Python може бути повільним порівняно з іншими мовами програмування, такими як С або Java, особливо при роботі з великими обсягами даних.',
        'Обмежена підтримка мультипотоковості: Python має обмежену підтримку мультипотоковості через використання глобального блокування GIL, що може призводити до проблем з продуктивністю.',
        'Низька захищеність від помилок: Python не має жорсткого контролю за типами даних, що може призводити до помилок під час виконання програми.',
      ],
      purpose:
        'Python - це мова програмування, яка використовується для розробки широкого спектру програмного забезпечення, включаючи наукові дослідження, веб-розробку, автоматизацію задач, розробку ігор та багато іншого. Вона відома своєю простотою, лаконічністю і легкістю вивчення, що робить її відмінним вибором для початківців у програмуванні, а також для швидкого прототипування нових проектів. ',
      versions: 'Python 1-3, Python 2.0-2.7, Python 3.0-3.10',

      rating: 4.5,
      numReviews: 10,
      syntax: mongoose.Types.ObjectId('644628ab94c8eb0b4ce130b9'),
    },
    {
      name: 'SQL',
      slug: 'sql',
      image: '/images/sql.jpg',
      images: ['sql.png', 'sql2.png'],
      category: 'Серверна сторона',
      developers: 'Едгар Ф. Кодд разом зі своїми колегами з IBM',
      description:
        'SQL (Structured Query Language) - це стандартизована мова запитів до реляційних баз даних. SQL дозволяє створювати, змінювати та управляти базами даних, виконувати запити для отримання певної інформації, створювати таблиці та відношення між ними, додавати, видаляти та модифікувати дані.SQL дозволяє виконувати запити для отримання даних з баз даних, які можуть використовуватись для аналізу, звітності та прийняття рішень. SQL використовується в різних областях, таких як банківська справа, логістика, медицина, соціальні мережі та інші галузі.',
      releaseDate: '1974 році',
      pros: [
        'Простота та легкість вивчення.',
        'Можливість працювати з великим обсягом даних.',
        'Незалежність від конкретної бази даних.',
        'Широке застосування в різних галузях',
      ],
      cons: [
        'Обмежена функціональність порівняно з іншими мовами програмування.',
        'Залежність від відповідної бази даних.',
        'Не ефективний для роботи з нереляційними даними.',
      ],
      purpose:
        'SQL (Structured Query Language) призначений для роботи з базами даних. Він використовується для зберігання, маніпулювання та опрацювання даних у реляційних базах даних (RDBMS). SQL дозволяє створювати, змінювати та видаляти дані, створювати таблиці та взаємодіяти з ними, знаходити та обробляти дані за допомогою запитів. ',
      versions:
        'SQL-86,SQL-89,SQL-92 SQL:1999 SQL:2003 SQL:2008 SQL:2011 SQL:2016 SQL:2019',

      rating: 4.5,
      numReviews: 10,
      syntax: mongoose.Types.ObjectId('644628ab94c8eb0b4ce130b4'),
    },
    {
      name: 'PHP',
      slug: 'php',
      image: '/images/php.jpg',
      images: ['php1.png', 'php2.png'],
      category: 'Серверна сторона',
      developers: 'Расмус Лердорф',
      description:
        'PHP (Hypertext Preprocessor) - це скриптова мова програмування, призначена для розробки веб-додатків та веб-сайтів. Вона підтримує широкий спектр функцій, таких як зєднання з базами даних, робота з формами, обробка файлів, генерація PDF-документів, створення зображень і т.д. PHP підтримує різні протоколи інтернету, включаючи HTTP, SMTP, POP3 і FTP, що робить його досить універсальною мовою для створення веб-додатків. PHP зазвичай використовується в поєднанні з HTML-кодом, що дозволяє вбудовувати PHP-скрипти безпосередньо в веб-сторінки.',
      releaseDate: '1995 році',
      pros: [
        'Легко вивчати і розуміти.',
        'Безкоштовний і має відкритий код.',
        'Підтримується на багатьох веб-серверах.',
        'Підтримується багатьма фреймворками, що дозволяє значно полегшити процес розробки.',
        'Дозволяє швидко розробляти веб-сайти та додатки.',
      ],
      cons: [
        'Завдяки простоті вивчення та використання може спричинити написання ненадійного та небезпечного коду.',
        'Іноді може бути повільним, особливо для великих проектів з великою кількістю запитів до баз даних.',
        'Має певні обмеження на платформах, які підтримують PHP.',
      ],
      purpose:
        'PHP призначений для розробки веб-додатків і складається з ряду вбудованих функцій і фреймворків, що дозволяє створювати динамічні сторінки, оброблювати дані з форм, робити запити до баз даних, генерувати звіти і т.д. Основним призначенням PHP є розробка серверної частини веб-додатків, а також створення інтерактивних веб-сайтів з використанням баз даних і скриптової технології на стороні сервера. ',
      versions: 'PHP 3, PHP 4, PHP 5, PHP 6, PHP 7, PHP 8 ',

      rating: 4.5,
      numReviews: 10,
      syntax: mongoose.Types.ObjectId('644628ab94c8eb0b4ce130b8'),
    },
    {
      name: 'HTML',
      slug: 'html',
      image: '/images/html.jpg',
      images: ['html1.png', 'html2.png'],
      category: 'HTML та CSS',
      developers:
        'Колектив вчених інформаційно-пошукового центру (CERN), на чолі з Тімом Бернерс-Лі',
      description:
        'HTML (Hypertext Markup Language) - це мова розмітки, яка використовується для створення веб-сторінок та інших документів, що відображаються у веб-браузері. HTML дозволяє вказати структуру та зміст документу за допомогою різноманітних тегів та атрибутів. HTML є основним стандартом веб-розробки та використовується разом з CSS та JavaScript для створення багатофункціональних веб-сайтів та додатків.',
      releaseDate: 'виник у 1991 році',
      pros: [
        'Простоту в освоєнні та використанні;',
        'Відкритий стандарт, що дозволяє використовувати його на будь-якій платформі та в будь-якому середовищі розробки;',
        'Сумісність з різними браузерами;',
        'Можливість розмітки будь-яких документів;',
        'Висока швидкість завантаження сторінки.',
      ],
      cons: [
        'Не може створювати динамічні сторінки;',
        'Іноді може бути повільним, особливо для великих проектів з великою кількістю запитів до баз даних.Неможливість самостійної валідації введених даних;',
        'Недостатня захищеність від хакерських атак.',
      ],
      purpose:
        'HTML (HyperText Markup Language) призначений для створення веб-сторінок та документів, що містять текст, зображення, відео, звук та інші мультимедійні елементи. HTML використовується для створення структури та вмісту веб-сторінок та інших документів, які можуть бути відображені в браузері.  ',
      versions: 'HTML 4, XHTML 1.0, HTML5',

      rating: 4.5,
      numReviews: 10,
      syntax: mongoose.Types.ObjectId('644628ab94c8eb0b4ce130b1'),
    },
  ],
  syntaxes: [
    {
      _id: '6444151aaa21aa29590fa4c0',
      name: 'python syntaxes',
      slug: 'python',
      syntaxName: [
        'Python - це інтерпретована мова програмування з динамічним звязуванням типів даних. Основна ідея Python полягає в тому, що код має бути легким для читання і розуміння. Python забезпечує широку підтримку функцій, модулів та бібліотек для різних задач програмування.',
        'Основний синтаксис Python базується на відступах. Блок коду відокремлюється відступами замість фігурних дужок, як у багатьох інших мовах програмування. Основні конструкції мови Python такі: ',
        'Змінні та присвоєння. Створення змінної здійснюється автоматично при присвоєнні значення. ',
        'Оператори порівняння. У Python використовуються стандартні оператори порівняння, такі як ==, <, >, <=, >=, !=.',
        'Умовні конструкції. Умовна конструкція if виконується, якщо умова після ключового слова if є істинною. Блок коду, що йде після if, відокремлюється відступом.',
        'Цикли. Один з найбільш поширених циклів у Python - це цикл for, який використовується для ітерації по послідовності елементів, наприклад, по списку.',
        'Функції. Функції в Python визначаються за допомогою ключового слова def.',
      ],
      codeExamples:
        '# Змінні не потрібно попередньо декларувати\na = 5\nb = "Hello, World!"\n\n# Вивід на екран\n print(a)  # 5\nprint(b)  # Hello, World!\n\n# Умовна конструкція if\nif a > 2:\n print("a більше 2")\nelse:\nprint("a менше або дорівнює 2")\n\n# Умовна конструкція elif\nif a > 10:\nprint("a більше 10")\nelif a > 5:\nprint("a більше 5, але менше або дорівнює 10")\nelse:\nprint("a менше або дорівнює 5")\n\n# Цикл for\nfor i in range(5):\nprint(i)\n\n# Функція\ndef multiply(x, y):\n return x * y\n# Виклик функції\nz = multiply(3, 4)\nprint(z)  # 12',
      libraries: 'NumPy, Pandas, Matplotlib,Scikit-learn, TensorFlow, Pygame',
      frameworks: 'Django, Flask, Pyramid, CherryPy, CherryPy, Tornado, Bottle',
      articles: 'https://www.python.org',
      news: 'Остання новина по Python - випуск версії 3.10, який відбувся в жовтні 2021 року. В цій версії було додано багато нових функцій та покращень, включаючи підтримку типів виразів, удосконалення асинхронного програмування, нові методи для роботи зі строками та байтами, покращену підтримку декораторів та інші функціональні покращення.',
    },
    {
      _id: '644628ab94c8eb0b4ce130b9',
      name: 'java syntaxes',
      slug: 'java',
      syntaxName: [
        'Java - це обєктно-орієнтована мова програмування, яка створювалась для розвитку програмного забезпечення, що працює на будь-яких пристроях. Синтаксис Java дуже схожий на синтаксис мови C++, але з деякими відмінностями.',
        'Класи та обєкти: Java є обєктно-орієнтованою мовою, тому програма Java зазвичай складається з класів і обєктів. ',
        'Методи: Методи в Java використовуються для визначення дій, які можуть виконувати обєкти.',
        'Змінні: У Java змінні можна визначити для зберігання даних, таких як цілі числа, дійсні числа, рядки і т.д.',
        'Керування потоком виконання: У Java використовується керування потоком виконання, таке як умовні конструкції if-else, цикли while і for, щоб контролювати порядок виконання коду.',
        'Обробка винятків: У Java є механізм обробки винятків, який дозволяє обробляти помилки в програмі.',
      ],
      codeExamples:
        'public class HelloWorld {\npublic static void main(String[] args) {\n System.out.println("Hello, World!");\n}\n}',
      libraries: 'Apache Commons, Guava, Jackson, Log4j, JUnit ',
      frameworks: 'Hibernate, Struts, Apache Struts, Vaadin, Dropwizard',
      articles:
        ' https://docs.oracle.com/en/java/javase/16/language/index.html',
      news: 'Останньою новиною щодо Java є випуск Java 17, який відбувся 14 вересня 2021 року. Він містить ряд нових функцій та поліпшень, включаючи покращення безпеки, вдосконалення ефективності та розширення функціональності мови.',
    },
    {
      _id: '644628ab94c8eb0b4ce130b1',
      name: 'html syntaxes',
      slug: 'html',
      syntaxName: [
        'HTML (Hypertext Markup Language) - це мова розмітки для створення веб-сторінок. HTML складається з різних тегів, які визначають вигляд та поведінку елементів на веб-сторінках. Основні теги HTML:',
        '<html> - визначає початок та кінець веб-сторінки. ',
        '<head> - визначає заголовок документа та містить різноманітні метадані.',
        '<body> - визначає основний вміст веб-сторінки.',
        '<p> - визначає абзац тексту.',
        '<a> - визначає посилання на іншу веб-сторінку або документ.',
        '<img> - визначає зображення.',
        '<ul> та <li> - визначають ненумерований список.',
        '<ol> та <li> - визначають нумерований список.',
      ],
      codeExamples:
        '<html>\n<head>\n<title>Назва сторінки</title>\n</head>\n<body>\n<h1>Привіт світ!</h1>\n<p>Це веб-сторінка</p>\n</body>\n</html>',
      libraries:
        'HTML - це мова розмітки для створення веб-сторінок, тому вона не використовує бібліотек. ',
      frameworks:
        'HTML (Hypertext Markup Language) не є програмним мовою і не використовує фреймворки.',
      articles:
        ' https://docs.oracle.com/en/java/javase/16/language/index.html',
      news: 'Останньою новиною про HTML є випуск оновленої специфікації HTML6, яка пропонує нові можливості для покращення доступності та функціональності веб-сайтів. Серед нововведень - покращені можливості для роботи з мультимедіа, включення 3D та AR/VR-елементів, покращення взаємодії з базами даних та багато іншого.',
    },
    {
      _id: '644628ab94c8eb0b4ce130b4',
      name: 'sql syntaxes',
      slug: 'sql',
      syntaxName: [
        'SQL (Structured Query Language) - це мова запитів для роботи з базами даних. SQL дозволяє створювати, змінювати, видаляти та запитувати дані з баз даних. Основні команди SQL:',
        'SELECT: використовується для запитування даних з бази даних. ',
        'INSERT: використовується для додавання даних до таблиці.',
        'UPDATE: використовується для оновлення існуючих записів у таблиці. ',
        'DELETE: використовується для видалення записів з таблиці.',
      ],
      codeExamples:
        'SELECT * FROM employees WHERE salary > 50000\nINSERT INTO customers (name, email, phone) VALUES (John Doe, john@example.com, 1234567890)\nUPDATE employees SET salary=salary*1.1 WHERE department=Sales\nDELETE FROM orders WHERE total < 100',
      libraries: 'JDBC (Java Database Connectivity), SQLAlchemy, Hibernate',
      frameworks: 'SQL не є фреймворком',
      articles:
        ' https://docs.oracle.com/en/java/javase/16/language/index.html',
      news: 'Однією з останніх новин у світі SQL є випуск версії 23.0 бази даних PostgreSQL в квітні 2021 року. PostgreSQL 23.0 містить багато нововведень, включаючи покращення продуктивності, нові функції, поліпшення безпеки, а також більшу сумісність зі стандартами SQL та JSON. Деякі з найцікавіших оновлень включають покращення управління памяттю, нові функції для роботи з JSON-даними, можливість обробки XML-даних та підтримку розширеного синтаксису SQL/JSON.',
    },
    {
      _id: '644628ab94c8eb0b4ce130b8',
      name: 'php syntaxes',
      slug: 'php',
      syntaxName: [
        'PHP - це скриптова мова програмування, яка використовується для розробки веб-додатків та динамічних сторінок. Ось декілька прикладів синтаксису PHP:',
        'Оголошення змінних',
        'Виведення тексту на сторінку.',
        'Робота з масивами ',
        'Умовні оператори.',
        'Цикли',
      ],
      codeExamples:
        '$name = "John"; // оголошення змінної зі значенням\n$age = 25; // оголошення числової змінної\n$is_active = true; // оголошення булевої змінної\necho "Hello, World!"; // виведення тексту на сторінку\n$fruits = array("apple", "banana", "orange"); // оголошення масиву\necho $fruits[0]; // виведення першого елементу масиву (apple)\nif ($age > 18) {\necho "You are an adult";\n} else {\necho "You are a minor";\n}',
      libraries: 'Composer, PHPUnit, Twig, PHPMailer',
      frameworks: 'Laravel, Symfony, CodeIgniter, Yii,  CakePHP, Phalcon ',
      articles:
        ' https://docs.oracle.com/en/java/javase/16/language/index.html',
      news: 'Однією з останніх новин по PHP є випуск версії PHP 8.1, який став доступний в листопаді 2021 року. В цій версії додано багато нових функцій та покращень, зокрема поліпшення швидкодії, нові засоби безпеки, нові функції роботи зі стрічками та більш гнучкі засоби програмування. Також зявилась підтримка асинхронного програмування, що дозволяє виконувати більш складні операції без блокування потоку виконання програми.',
    },
  ],
};
export default data;
